{"meta":{"title":"朝花夕拾处","subtitle":"","description":"","author":"freak","url":"https://freak-guy.github.io","root":"/"},"pages":[],"posts":[{"title":"且为记","slug":"且为记","date":"2023-04-25T13:57:13.000Z","updated":"2023-05-06T08:38:28.150Z","comments":true,"path":"2023/04/25/且为记/","link":"","permalink":"https://freak-guy.github.io/2023/04/25/%E4%B8%94%E4%B8%BA%E8%AE%B0/","excerpt":"","text":"无题 “一个人真正老去的开始，就是他不愿意接受新事物的那一刻。”正是基于这个理念，这个网站于此诞生。我其实从未害怕过老去，或者是所谓成长；只不过我不愿成为一个一事无成的成年人或者老人。我无法改变我一事无成的事实，所以我只好改变我已老去的事实。毕竟，裘马轻狂的绝望要好过筚路蓝缕的绝望；故而，弱冠青丝的无能也要好过耄耋黄发的无能。 “年轻，真是一个理由，一个实际上毫无用处的理由。” 因此，我挣扎于充满未知的海洋，一以消除无尽的苦闷，一以展现自己的年轻亦或是掩盖自己的无能。 我曾致力于给予每一件重要之事一个美好的开始，譬如一个充满意义的日期，譬如我为它做好的一切准备。可惜，我从未能真正意义上的做到这一切。因而我失去了诸多迎接新事物的准备，重要却失去，失去但重要也成为了我前十年挥之不去的阴霾。 我已经失去了太多，不想再因此失去更多——最好的时光永远是当下——也是基于这样的理念，我在考试前写出了这篇文章。更何况，更何况！这个日期也很难不说是一个重要的日期，不是么？总有些事情要重要于我所面对的考试，哪怕还未到来，哪怕已经失去，哪怕毫无意义。 在我曾经以为并且自得于自己拥有一切，只是失去烛火的时候，一只橘猫闯进了我的生活。她破天荒地主动靠近我，想要想我寻求些食物；那时，哪怕我知道自己手中没有任何食物，我也翻遍了全身——无能而又一无所有的可怜人儿只能寄希望于所谓神明。奇迹没有发生，她失望地离开了。 正是她失望地转身，才将我那幼稚到以为自己拥有一切的幻想无情的碾地粉碎，直到那时，我才明了： 我依旧一无所有，现在便连烛火也失去了，那也曾是我惟一的光。 她的失望离去，一如那年问我要糖的某人。我之后可以买很多很多的糖，也可以带很多很多的猫粮；可这从未改变我一无所有的事实，也未能挽回过去的一切。 她那充满希望而后失望的眼神一直伴随着我，无情地撕碎我为自己构建的所有名为“拥有”的泡影；赤裸裸的将残酷事实摆在我的面前，绝情又冷漠。目之所及，手之所触，都是那一个个空空如也的口袋，没有糖也没有猫粮，冷漠而又无情。 我曾难自拔于自己一无所有的事实，恣意挥霍自己仅有的时间，浑浑噩噩，不知深浅，不问冷暖。虽然，我心匪石，人非草木。但我自觉自身之无能孱弱，所以从未妄想于拥有一切，而是珍惜自己仅有的一切。 只不过以后不会再带糖了，她想要的从来都不是糖，我也从未拥有；最重要的是，也再也不会有那个问我要糖的人了。 以上，无关于所谓爱情，亦不止于此。 零碎 最近书读的太少，竟时常会有三言两语的零碎浮现脑海。我向来是对偶现的想法不甚在意的，并以为出现过的他们会再次浮现于我的脑海，而那时的我已经做好准备并可以将之付诸笔端；一如我对待其他的人、事一般。 那是我的谬论。亦或是我的自我欺骗。那些年浮现在我脑海中的想法不会回来了，无论是幼稚可笑亦或是令人抚掌，都不会再回来了。他们从我的脑海中旅居一时，便又乘着那些年吹过我的风、照亮我的日光像从我脚边溜走的蚂蚁一般，离开了……一如当年教室里的时钟带走时间那般无情，而时间，又带走了我错过的那些人，那些事。 说到错过，我时常想起一辆公交车。我曾经眼睁睁的看着我眼前的红绿灯由绿变黄再变红——如此，我便错过了这个红绿灯。与我一同停下的，便是时常闯入我脑海里的那辆公交车。时间还有富余，我便转头询问他，错过了？他岿然不动，细数着红绿灯前的一分一秒，我自觉无趣，厌恶起了自己肉体凡胎的矫情。便也做起了一辆公交车，再也不担心前面的红绿灯是红是绿；再也不担心前方的路是陂是平。其实，我真正想让自己不担心、不后悔的，是错过。在以后很长的时间里我都想象自己是那辆公交车，毫无感情的，平稳的行驶在属于自己的道路上。把所有心事付诸一炬，对内心一定是温柔的；但对错过的人，错过的事却显得冷漠无情以致残忍。一如那辆车对我的无动于衷。 我也残忍了。在路上平稳的行使，把所有的往事都抛诸脑后。于是我不再像人了，活像一辆车 故而，抱着想要将要捡起些许曾经拥有又即将失去的零碎的想法，我创建了这个个人博客。一如朝花凋落，后知后觉，残阳葬花，亦不为晚。 此时此日，此事相对，苦闷难抑，临书狂乱，不知所言，呓语二三。且为记。","categories":[],"tags":[{"name":"long-text","slug":"long-text","permalink":"https://freak-guy.github.io/tags/long-text/"}]},{"title":"hello, world","slug":"world","date":"2023-04-22T11:33:54.000Z","updated":"2023-05-06T08:42:05.916Z","comments":true,"path":"2023/04/22/world/","link":"","permalink":"https://freak-guy.github.io/2023/04/22/world/","excerpt":"","text":"1972年，布莱恩·柯汉林用B语言把hello, world与计算机编程一起带入了我们的视线 如今，hello, world已经成为已经成为所有人接触电脑编程中第一个程序内容 就如同刚刚诞生到这个世界的孩子一般，我们对这个崭新的世界一无所知；但是我们与婴儿亦有不同：我们已做好迎接一切一切的准备，我们用hello, world代替了哭泣。 那么，这个代表这个网站诞生的帖子的唯一内容，便是 12345678main()&#123; extern a,b,c; putchar(a);putchar(b);putchar(c);putchar(&#x27;!*n&#x27;);&#125;a&#x27;hell&#x27;;b&#x27;o,w&#x27;;c","categories":[],"tags":[{"name":"landmark","slug":"landmark","permalink":"https://freak-guy.github.io/tags/landmark/"}]},{"title":"test","slug":"test","date":"2023-02-16T09:56:42.000Z","updated":"2023-05-06T08:40:42.234Z","comments":true,"path":"2023/02/16/test/","link":"","permalink":"https://freak-guy.github.io/2023/02/16/test/","excerpt":"","text":"test test test test","categories":[],"tags":[{"name":"test","slug":"test","permalink":"https://freak-guy.github.io/tags/test/"}]}],"categories":[],"tags":[{"name":"long-text","slug":"long-text","permalink":"https://freak-guy.github.io/tags/long-text/"},{"name":"landmark","slug":"landmark","permalink":"https://freak-guy.github.io/tags/landmark/"},{"name":"test","slug":"test","permalink":"https://freak-guy.github.io/tags/test/"}]}